Repository: xcv58/MacTools
Catalog: Plugins/HideNotch/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# action.disable.title
source: 显示刘海
ar: إظهار النتوء
de: Aussparung anzeigen
en: Show Notch
es: Mostrar muesca
fr: Afficher l’encoche
ja: ノッチを表示
ko: 노치 표시
pt: Mostrar recorte
ru: Показать вырез
tr: Çentiği Göster
zh_hant: 顯示瀏海

# action.enable.title
source: 隐藏刘海
ar: إخفاء النتوء
de: Aussparung ausblenden
en: Hide Notch
es: Ocultar muesca
fr: Masquer l’encoche
ja: ノッチを隠す
ko: 노치 가리기
pt: Ocultar recorte
ru: Скрыть вырез
tr: Çentiği Gizle
zh_hant: 隱藏瀏海

# metadata.title
source: 隐藏刘海
ar: إخفاء النوتش
de: Kerbe ausblenden
en: Hide Notch
es: Ocultar muesca
fr: Masquer l'encoche
ja: ノッチを隠す
ko: 노치 숨기기
pt: Ocultar entalhe
ru: Скрыть вырез
tr: Çentiği Gizle
zh_hant: 隱藏劉海

# metadata.description
source: 自动遮挡刘海屏顶部区域
ar: إخفاء المنطقة العلوية المحيطة بحز الشاشة تلقائيًا.
de: Maskieren Sie automatisch den oberen Bereich um eine Anzeigekerbe.
en: Automatically mask the top area around a display notch.
es: Enmascare automáticamente el área superior alrededor de una muesca de la pantalla.
fr: Masquer automatiquement la zone supérieure autour d'une encoche d'affichage.
ja: ディスプレイ ノッチの周囲の上部領域を自動的にマスクします。
ko: 디스플레이 노치 주변의 상단 영역을 자동으로 마스킹합니다.
pt: Mascarar automaticamente a área superior ao redor de um entalhe da tela.
ru: Автоматически маскировать верхнюю область вокруг выреза дисплея.
tr: Ekran çentiğinin çevresindeki üst alanı otomatik olarak maskeler.
zh_hant: 自動遮擋劉海螢幕頂部區域

# panel.subtitle.enabled
source: 已开启
ar: تشغيل
de: Ein
en: On
es: Activado
fr: Activé
ja: オン
ko: 켜기
pt: Ativado
ru: Включено
tr: Açık
zh_hant: 已開啟

# panel.subtitle.noSupportedDisplay
source: 未检测到刘海屏
ar: لم يتم اكتشاف شاشة مسننة
de: Keine gekerbte Anzeige erkannt
en: No notched display detected
es: No se detectó ninguna pantalla con muescas
fr: Aucun affichage cranté détecté
ja: ノッチ付きディスプレイが検出されませんでした
ko: 노치 디스플레이가 감지되지 않음
pt: Nenhuma tela com entalhe detectada
ru: Дисплей с вырезом не обнаружен
tr: Çentikli ekran algılanmadı
zh_hant: 未檢測到劉海螢幕

# panel.subtitle.closing
source: 正在关闭
ar: إيقاف
de: Ausschalten
en: Turning off
es: Apagar
fr: Désactiver
ja: オフにします
ko: 끄는 중
pt: Desligando
ru: Выключение
tr: Kapatılıyor
zh_hant: 正在關閉

# error.maskWindowCreationFailed
source: 无法创建隐藏刘海遮挡层。
ar: غير قادر على إنشاء طبقة قناع الشق.
de: Die Kerbmaskenebene konnte nicht erstellt werden.
en: Unable to create the notch mask layer.
es: No se puede crear la capa de máscara de muesca.
fr: Impossible de créer le calque de masque d'entaille.
ja: ノッチ マスク レイヤを作成できません。
ko: 노치 마스크 레이어를 생성할 수 없습니다.
pt: Não foi possível criar a camada de máscara de entalhe.
ru: Невозможно создать слой маски выреза.
tr: Çentik maske katmanı oluşturulamadı.
zh_hant: 無法創建隱藏劉海遮擋層。

# error.maskWindowCreationFailedFormat
source: 无法为 %@ 创建刘海遮挡层：%@
ar: غير قادر على إنشاء طبقة قناع الشق لـ %@: %@
de: Kerbmaskenebene für %@: %@ konnte nicht erstellt werden.
en: Unable to create the notch mask layer for %@: %@
es: No se puede crear la capa de máscara de muesca para %@: %@
fr: Impossible de créer le calque de masque d'encoche pour %@ : %@
ja: %@ のノッチ マスク レイヤを作成できません: %@
ko: %@에 대한 노치 마스크 레이어를 생성할 수 없습니다: %@
pt: Não é possível criar a camada de máscara de entalhe para %@: %@
ru: Невозможно создать слой маски выреза для %@: %@
tr: %@ için çentik maske katmanı oluşturulamadı: %@
zh_hant: 無法為 %@ 創建劉海遮擋層：%@

# error.rollbackFailed.format
source: %@；恢复先前状态失败：%@
ar: %@؛ تعذّرت استعادة الحالة السابقة: %@
de: %@; der vorherige Zustand konnte nicht wiederhergestellt werden: %@
en: %@; restoring the previous state failed: %@
es: %@; no se pudo restaurar el estado anterior: %@
fr: %@ ; la restauration de l’état précédent a échoué : %@
ja: %@；以前の状態を復元できませんでした：%@
ko: %@; 이전 상태를 복원할 수 없습니다: %@
pt: %@; não foi possível restaurar o estado anterior: %@
ru: %@; не удалось восстановить предыдущее состояние: %@
tr: %@; önceki durum geri yüklenemedi: %@
zh_hant: %@；恢復先前狀態失敗：%@
